"""Category definitions for time tracking activities."""

categories = dict()
categories["Физическая активность"] = (
    "йога",
    "велопокатушка",
)

categories["Музыка"] = (
    "музыка",
    "калимба",
    "гитара",
    "балалайка",
    "пение",
    "банджо",
    "пианино",
    "вистл",
    "блокфлейта",
    "саламури",
    "скрипка",
    "квинтон",
    "альт",
    "виолончель",
    "эрху",
    "гиджак",
    "мандолина",
    "бузуки",
    "бас",
    "уд",
    "занятие гитарой",
    "занятие басом",
    "занятие скрипкой",
    "занятие альтом",
    "занятие виолончелью",
    "занятие пением",
    "занятие флейтой",
    "занятие арфой",
    "занятие теорией музыки",
)

categories["Бытовое"] = (
    "быт",
    "побрился",
    "помылся",
    "уборка",
    "ремонт",
    "утро",
    "утренние процедуры",
    "вечерние процедуры",
    "к выходу готов",
)

categories["Медицина"] = (
    "медицина",
    "болел",
)

categories["Техническое"] = (
    "программирование",
    "электроника",
    "config",
    "анализ данных",
    "gamedev",
)

categories["Языки"] = (
    "английский",
    "занятие английским",
)

categories["Отдых"] = (
    "худ",
    "аниме",
    "манга",
    "фильм",
    "думал",
    "прогулка",
    "гамак",
)

categories["Работа"] = (
    "работа",
    "занятие вождением",
    "вождение",
)

categories["Хобби"] = (
    "кожа",
    "шитьё",
    "велосипед",
    "мастерил",
    "моделирование",
    "знание",
    "tracker",
    "рисование",
    "токарка",
)
